//
// Created by liu on 18-12-7.
//

#include "value.h"

const char aInitDisplayBoardArray[SIZE][SIZE * CHARSIZE + 1] =
        {
                "©³©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©·",
                "©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì",
                "©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì",
                "©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì",
                "©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì",
                "©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì",
                "©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì",
                "©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì",
                "©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì",
                "©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì",
                "©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì",
                "©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì",
                "©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì",
                "©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì",
                "©»©Û©Û©Û©Û©Û©Û©Û©Û©Û©Û©Û©Û©Û©¿"
        };
const char play1Pic[] = "¡ñ";
const char play1CurrentPic[] = "¡ø";
const char play2Pic[] = "¡ò";
const char play2CurrentPic[] = "¡÷";
int aRecordBoard[SIZE][SIZE];
char aDisplayBoardArray[SIZE][SIZE * CHARSIZE + 1];
char input[MAX] = {0};

